# Example 4

INSERT INTO SELECT with WHERE

## Import libraries

In [1]:
import sqlite3
import pandas as pd

## Create a connection object

In [2]:
con = sqlite3.connect('../Database.db')
cur = con.cursor()

## SQL statement

In [3]:
# The INSERT INTO SELECT statement copies data from one table and inserts it into another table.
# The INSERT INTO SELECT statement requires that the data types in source and target tables match.
# Note: The existing records in the target table are unaffected.
query = '''
            INSERT INTO Customers (CustomerID, CustomerName, City, Country)
            SELECT SupplierID, SupplierName, City, Country 
            FROM Suppliers
            WHERE Country = "Germany"
        '''
cur.execute(query);

## Show table

In [4]:
query = '''
            SELECT * 
            FROM Customers
        '''
df = pd.read_sql_query(query, con)
df.tail()

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
89,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland
90,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,01-012,Poland
91,11,Heli Süßwaren GmbH & Co. KG,None,None,Berlin,None,Germany
92,12,Plutzer Lebensmittelgroßmärkte AG,None,None,Frankfurt,None,Germany
93,13,Nord-Ost-Fisch Handelsgesellschaft mbH,None,None,Cuxhaven,None,Germany

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 94 entries, 0 to 93
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    94 non-null     int64
 1   CustomerName  94 non-null     object
 2   ContactName   91 non-null     object
 3   Address       91 non-null     object
 4   City          94 non-null     object
 5   PostalCode    91 non-null     object
 6   Country       94 non-null     object
dtypes: int64(1), object(6)
memory usage: 5.3+ KB

## Close the connection

In [6]:
con.close()